app/controllers/boards_controller.rb

 def index
   @boards = params[:tag_id].present? ? Tag.find(params[:tag_id]).boards : Board.all
   @boards = Board.page(params[:page])
---
SELECT  `boards`.* FROM `boards` LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM `boards`

 def create
   board = Board.new(board_params)
   if board.save
---
INSERT INTO `boards` (`name`, `title`, `body`, `created_at`, `updated_at`) VALUES ('nagamine', 'Railsについて', 'test', '2019-10-08 12:44:24', '2019-10-08 12:44:24')

 def destroy
   @board.destroy
---
DELETE FROM `boards` WHERE `boards`.`id` = 11

 def set_target_board
   @board = Board.find(params[:id])
---
SELECT  `boards`.* FROM `boards` WHERE `boards`.`id` = 13 LIMIT 1